vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
/**
 * @file dmx.cpp
 *
 */
/* Copyright (C) 2021-2024 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#pragma GCC push_options
#pragma GCC optimize ("O3")
#pragma GCC optimize ("-funroll-loops")
#pragma GCC optimize ("-fprefetch-loop-arrays")

#include <cstdint>
#include <cstring>
#include <algorithm>
#include <cassert>

#include "dmx.h"
#include "dmxconst.h"

#include "rdm.h"
#include "rdm_e120.h"

#include "gd32.h"
#include "gd32_uart.h"
#include "gd32/dmx_config.h"
#include "dmx_internal.h"

#include "logic_analyzer.h"

#include "debug.h"

#ifndef ALIGNED
# define ALIGNED __attribute__ ((aligned (4)))
#endif

/**
 * Needed for older GD32F firmware
 */
#if !defined(USART_TRANSMIT_DMA_ENABLE)
# define USART_TRANSMIT_DMA_ENABLE	USART_DENT_ENABLE
#endif

/**
 * https://www.gd32-dmx.org/memory.html
 */
#if defined (GD32F20X) || defined (GD32F4XX)
# define SECTION_DMA_BUFFER					__attribute__ ((section (".dmx")))
#else
# define SECTION_DMA_BUFFER
#endif

namespace dmx {
enum class TxRxState {
	IDLE, BREAK, MAB, DMXDATA, DMXINTER, RDMDATA, CHECKSUMH, CHECKSUML, RDMDISC
};

enum class PortState {
	IDLE, TX, RX
};

struct TxDmxPacket {
	uint8_t data[dmx::buffer::SIZE];	// multiple of uint16_t
	uint16_t nLength;
};

struct TxData {
	struct TxDmxPacket dmx;
	OutputStyle outputStyle;
	volatile TxRxState State;
};

struct RxDmxPackets {
	uint32_t nPerSecond;
	uint32_t nCount;
	uint32_t nCountPrevious;
	uint16_t nTimerCounterPrevious;
};

struct RxRdmPackets {
	uint32_t nIndex;
	uint16_t nChecksum;					// This must be uint16_t
	uint16_t nDiscIndex;
};

struct RxData {
	uint8_t data[dmx::buffer::SIZE];	// multiple of uint16_t
	union {
		volatile RxRdmPackets Rdm;
		volatile Statistics Dmx;
	};
	volatile TxRxState State;
};

struct DirGpio {
	uint32_t nPort;
	uint32_t nPin;
};

}  // namespace dmx

using namespace dmx;

static constexpr DirGpio s_DirGpio[DMX_MAX_PORTS] = {
		{ config::DIR_PORT_0_GPIO_PORT, config::DIR_PORT_0_GPIO_PIN },
#if DMX_MAX_PORTS >= 2
		{ config::DIR_PORT_1_GPIO_PORT, config::DIR_PORT_1_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 3
		{ config::DIR_PORT_2_GPIO_PORT, config::DIR_PORT_2_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 4
		{ config::DIR_PORT_3_GPIO_PORT, config::DIR_PORT_3_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 5
		{ config::DIR_PORT_4_GPIO_PORT, config::DIR_PORT_4_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 6
		{ config::DIR_PORT_5_GPIO_PORT, config::DIR_PORT_5_GPIO_PIN },
#endif
#if DMX_MAX_PORTS >= 7
		{ config::DIR_PORT_6_GPIO_PORT, config::DIR_PORT_6_GPIO_PIN },
#endif
#if DMX_MAX_PORTS == 8
		{ config::DIR_PORT_7_GPIO_PORT, config::DIR_PORT_7_GPIO_PIN },
#endif
};

static volatile PortState sv_PortState[dmx::config::max::PORTS] ALIGNED;
static volatile dmx::TotalStatistics sv_TotalStatistics[dmx::config::max::PORTS] ALIGNED;

// DMX RX

[[maybe_unused]] static uint8_t s_RxDmxPrevious[dmx::config::max::PORTS][dmx::buffer::SIZE] ALIGNED;
static volatile RxDmxPackets sv_nRxDmxPackets[dmx::config::max::PORTS] ALIGNED;

// RDM RX
volatile uint32_t gv_RdmDataReceiveEnd;

// DMX RDM RX

static RxData s_RxBuffer[dmx::config::max::PORTS] ALIGNED;

// DMX TX

static TxData s_TxBuffer[dmx::config::max::PORTS] ALIGNED SECTION_DMA_BUFFER;

static uint32_t s_nDmxTransmitBreakTime;
static uint32_t s_nDmxTransmitMabTime;
static uint32_t s_nDmxTransmitInterTime;

static void irq_handler_dmx_rdm_input(const uint32_t uart, const uint32_t nPortIndex) {
	uint32_t nIndex;
	uint16_t nCounter;

	if (RESET != (USART_REG_VAL(uart, USART_FLAG_FERR) & BIT(USART_BIT_POS(USART_FLAG_FERR)))) {
		USART_REG_VAL(uart, USART_FLAG_FERR) &= ~BIT(USART_BIT_POS(USART_FLAG_FERR));
#if defined (GD32H7XX)
		static_cast<void>(GET_BITS(USART_RDATA(uart), 0U, 8U));
#else
		static_cast<void>(GET_BITS(USART_DATA(uart), 0U, 8U));
#endif
		if (s_RxBuffer[nPortIndex].State == TxRxState::IDLE) {
			s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket = 0;
			s_RxBuffer[nPortIndex].State = TxRxState::BREAK;
		}
		return;
	}

#if defined (GD32H7XX)
	const auto data = static_cast<uint8_t>(GET_BITS(USART_RDATA(uart), 0U, 8U));
#else
	const auto data = static_cast<uint8_t>(GET_BITS(USART_DATA(uart), 0U, 8U));
#endif

	switch (s_RxBuffer[nPortIndex].State) {
	case TxRxState::IDLE:
		s_RxBuffer[nPortIndex].State = TxRxState::RDMDISC;
		s_RxBuffer[nPortIndex].data[0] = data;
		s_RxBuffer[nPortIndex].Rdm.nIndex = 1;
#if DMX_MAX_PORTS >= 5
		if (nPortIndex < 4) {
#endif
			sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious = static_cast<uint16_t>(TIMER_CNT(TIMER2));
#if DMX_MAX_PORTS >= 5
		} else {
			sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious = static_cast<uint16_t>(TIMER_CNT(TIMER3));
		}
#endif
		break;
	case TxRxState::BREAK:
		switch (data) {
		case START_CODE:
			s_RxBuffer[nPortIndex].data[0] = START_CODE;
			s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket = 1;
			sv_nRxDmxPackets[nPortIndex].nCount++;
			s_RxBuffer[nPortIndex].State = TxRxState::DMXDATA;
#if DMX_MAX_PORTS >= 5
			if (nPortIndex < 4) {
#endif
				sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious = static_cast<uint16_t>(TIMER_CNT(TIMER2));
#if DMX_MAX_PORTS >= 5
			} else {
				sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious = static_cast<uint16_t>(TIMER_CNT(TIMER3));
			}
#endif
			break;
		case E120_SC_RDM:
			s_RxBuffer[nPortIndex].data[0] = E120_SC_RDM;
			s_RxBuffer[nPortIndex].Rdm.nChecksum = E120_SC_RDM;
			s_RxBuffer[nPortIndex].Rdm.nIndex = 1;
			s_RxBuffer[nPortIndex].State = TxRxState::RDMDATA;
			break;
		default:
			s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
			break;
		}
		break;
		case TxRxState::DMXDATA:
			nIndex = s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket;
			s_RxBuffer[nPortIndex].data[nIndex] = data;
			s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket++;

