vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
// DMX Send

void Dmx::SetDmxBreakTime(uint32_t nBreakTime) {
	s_nDmxTransmitBreakTime = std::max(transmit::BREAK_TIME_MIN, nBreakTime);
	SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
}

void Dmx::SetDmxMabTime(uint32_t nMabTime) {
	s_nDmxTransmitMabTime = std::max(transmit::MAB_TIME_MIN, nMabTime);
	SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
}

void Dmx::SetDmxPeriodTime(uint32_t nPeriod) {
	m_nDmxTransmitPeriodRequested = nPeriod;

	auto nLengthMax = s_TxBuffer[0].dmx.nLength;

	for (uint32_t nPortIndex = 1; nPortIndex < dmx::config::max::PORTS; nPortIndex++) {
		const auto nLength = s_TxBuffer[nPortIndex].dmx.nLength;
		if (nLength > nLengthMax) {
			nLengthMax = nLength;
		}
	}

	auto nPackageLengthMicroSeconds = s_nDmxTransmitBreakTime + s_nDmxTransmitMabTime + (nLengthMax * 44U);

	// The GD32F4xx/GD32H7XX Timer 1 has a 32-bit counter
#if  defined(GD32F4XX) || defined (GD32H7XX)
#else
	if (nPackageLengthMicroSeconds > (static_cast<uint16_t>(~0) - 44U)) {
		s_nDmxTransmitBreakTime = std::min(transmit::BREAK_TIME_TYPICAL, s_nDmxTransmitBreakTime);
		s_nDmxTransmitMabTime = transmit::MAB_TIME_MIN;
		nPackageLengthMicroSeconds = s_nDmxTransmitBreakTime + s_nDmxTransmitMabTime + (nLengthMax * 44U);
	}
#endif

	if (nPeriod != 0) {
		if (nPeriod < nPackageLengthMicroSeconds) {
			m_nDmxTransmitPeriod = std::max(transmit::BREAK_TO_BREAK_TIME_MIN, nPackageLengthMicroSeconds + 44U);
		} else {
			m_nDmxTransmitPeriod = nPeriod;
		}
	} else {
		m_nDmxTransmitPeriod = std::max(transmit::BREAK_TO_BREAK_TIME_MIN, nPackageLengthMicroSeconds + 44U);
	}

	s_nDmxTransmitInterTime = m_nDmxTransmitPeriod - nPackageLengthMicroSeconds;

	m_nDmxTransmitBreakTime = s_nDmxTransmitBreakTime;
	m_nDmxTransmitMabTime = s_nDmxTransmitMabTime;

	DEBUG_PRINTF("nPeriod=%u, nLengthMax=%u, m_nDmxTransmitPeriod=%u, nPackageLengthMicroSeconds=%u -> s_nDmxTransmitInterTime=%u", nPeriod, nLengthMax, m_nDmxTransmitPeriod, nPackageLengthMicroSeconds, s_nDmxTransmitInterTime);
}

void Dmx::SetDmxSlots(uint16_t nSlots) {
	if ((nSlots >= 2) && (nSlots <= dmx::max::CHANNELS)) {
		m_nDmxTransmitSlots = nSlots;

		for (uint32_t i = 0; i < dmx::config::max::PORTS; i++) {
			m_nDmxTransmissionLength[i] = std::min(m_nDmxTransmissionLength[i], static_cast<uint32_t>(nSlots));
		}

		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

void Dmx::SetOutputStyle(const uint32_t nPortIndex, const dmx::OutputStyle outputStyle) {
	assert(nPortIndex < dmx::config::max::PORTS);
	s_TxBuffer[nPortIndex].outputStyle = outputStyle;
}

dmx::OutputStyle Dmx::GetOutputStyle(const uint32_t nPortIndex) const {
	assert(nPortIndex < dmx::config::max::PORTS);
	return s_TxBuffer[nPortIndex].outputStyle;
}

void Dmx::SetSendData(const uint32_t nPortIndex, const uint8_t *pData, uint32_t nLength) {
	assert(nPortIndex < dmx::config::max::PORTS);

	auto *p = &s_TxBuffer[nPortIndex];
	auto *pDst = p->dmx.data;

	nLength = std::min(nLength, static_cast<uint32_t>(m_nDmxTransmitSlots));
	p->dmx.nLength = static_cast<uint16_t>(nLength + 1);

	memcpy(pDst, pData,  nLength);

	if (nLength != m_nDmxTransmissionLength[nPortIndex]) {
		m_nDmxTransmissionLength[nPortIndex] = nLength;
		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

void Dmx::SetSendDataWithoutSC(const uint32_t nPortIndex, const uint8_t *pData, uint32_t nLength) {
	assert(nPortIndex < dmx::config::max::PORTS);

	auto *p = &s_TxBuffer[nPortIndex];
	auto *pDst = p->dmx.data;

	nLength = std::min(nLength, static_cast<uint32_t>(m_nDmxTransmitSlots));
	p->dmx.nLength = static_cast<uint16_t>(nLength + 1);

	pDst[0] = START_CODE;
	memcpy(&pDst[1], pData,  nLength);

	if (nLength != m_nDmxTransmissionLength[nPortIndex]) {
		m_nDmxTransmissionLength[nPortIndex] = nLength;
		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

void Dmx::Blackout() {
	DEBUG_ENTRY

	for (uint32_t nPortIndex = 0; nPortIndex < DMX_MAX_PORTS; nPortIndex++) {
		if (m_dmxPortDirection[nPortIndex] == dmx::PortDirection::OUTP) {
			const auto nUart = _port_to_uart(nPortIndex);

			StopData(nUart, nPortIndex);
			ClearData(nPortIndex);
			StartData(nUart, nPortIndex);
		}
	}

	DEBUG_EXIT
}

void Dmx::FullOn() {
	DEBUG_ENTRY

	for (uint32_t nPortIndex = 0; nPortIndex < DMX_MAX_PORTS; nPortIndex++) {
		if (m_dmxPortDirection[nPortIndex] == dmx::PortDirection::OUTP) {
			const auto nUart = _port_to_uart(nPortIndex);

			StopData(nUart, nPortIndex);

			auto *p = &s_TxBuffer[nPortIndex];
			auto *p16 = reinterpret_cast<uint16_t *>(p->dmx.data);

			for (auto i = 0; i < dmx::buffer::SIZE / 2; i++) {
				*p16++ = UINT16_MAX;
			}

			p->dmx.data[0] = dmx::START_CODE;
			p->dmx.nLength = 513;

			StartData(nUart, nPortIndex);
		}
	}

	DEBUG_EXIT
}

void Dmx::StartOutput(const uint32_t nPortIndex) {
	if ((sv_PortState[nPortIndex] == dmx::PortState::TX)
			&& (s_TxBuffer[nPortIndex].outputStyle == dmx::OutputStyle::DELTA)
			&& (s_TxBuffer[nPortIndex].State == dmx::TxRxState::IDLE)) {

		StartDmxOutput(nPortIndex);
	}
}

static bool s_doForce;

void Dmx::SetOutput(const bool doForce) {
	if (doForce) {
		s_doForce = true;
		for (uint32_t nPortIndex = 0; nPortIndex < dmx::config::max::PORTS; nPortIndex++) {
			if ((sv_PortState[nPortIndex] == dmx::PortState::TX)
					&& (s_TxBuffer[nPortIndex].outputStyle == dmx::OutputStyle::CONTINOUS)) {
				StopData(_port_to_uart(nPortIndex), nPortIndex);
			}
		}
		return;
	}

	for (uint32_t nPortIndex = 0; nPortIndex < dmx::config::max::PORTS; nPortIndex++) {
		if (sv_PortState[nPortIndex] == dmx::PortState::TX) {
			const auto b = ((s_TxBuffer[nPortIndex].outputStyle == dmx::OutputStyle::CONTINOUS) && s_doForce);
			if (b || ((s_TxBuffer[nPortIndex].outputStyle == dmx::OutputStyle::DELTA) && (s_TxBuffer[nPortIndex].State == dmx::TxRxState::IDLE))) {
				StartDmxOutput(nPortIndex);
			}
		}
	}

	s_doForce = false;
}

void Dmx::StartData(const uint32_t nUart, const uint32_t nPortIndex) {
	assert(nPortIndex < dmx::config::max::PORTS);
	assert(sv_PortState[nPortIndex] == PortState::IDLE);

	if (m_dmxPortDirection[nPortIndex] == dmx::PortDirection::OUTP) {
		sv_PortState[nPortIndex] = PortState::TX;
		if (s_TxBuffer[nPortIndex].outputStyle == dmx::OutputStyle::CONTINOUS) {
			StartDmxOutput(nPortIndex);
		}
	} else if (m_dmxPortDirection[nPortIndex] == dmx::PortDirection::INP) {
		s_RxBuffer[nPortIndex].State = TxRxState::IDLE;

		while (RESET == usart_flag_get(nUart, USART_FLAG_TBE))
			;

		usart_interrupt_flag_clear(nUart, USART_INT_FLAG_RBNE);
		usart_interrupt_enable(nUart, USART_INT_RBNE);

