vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
		sv_PortState[nPortIndex] = PortState::RX;

#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
		switch (nPortIndex) {
		case 0:
			TIMER_DMAINTEN(TIMER2) |= (uint32_t) TIMER_INT_CH0;
			break;
#if DMX_MAX_PORTS >= 2
		case 1:
			TIMER_DMAINTEN(TIMER2) |= (uint32_t) TIMER_INT_CH1;
			break;
#endif
#if DMX_MAX_PORTS >= 3
		case 2:
			TIMER_DMAINTEN(TIMER2) |= (uint32_t) TIMER_INT_CH2;
			break;
#endif
#if DMX_MAX_PORTS >= 4
		case 3:
			TIMER_DMAINTEN(TIMER2) |= (uint32_t) TIMER_INT_CH3;
			break;
#endif
#if DMX_MAX_PORTS >= 5
		case 4:
			TIMER_DMAINTEN(TIMER3) |= (uint32_t) TIMER_INT_CH0;
			break;
#endif
#if DMX_MAX_PORTS >= 6
		case 5:
			TIMER_DMAINTEN(TIMER3) |= (uint32_t) TIMER_INT_CH1;
			break;
#endif
#if DMX_MAX_PORTS >= 7
		case 6:
			TIMER_DMAINTEN(TIMER3) |= (uint32_t) TIMER_INT_CH2;
			break;
#endif
#if DMX_MAX_PORTS == 8
		case 7:
			TIMER_DMAINTEN(TIMER3) |= (uint32_t) TIMER_INT_CH3;
			break;
#endif
		default:
			assert(0);
			__builtin_unreachable();
			break;
		}
#endif
	} else {
		assert(0);
		__builtin_unreachable();
	}
}


// DMX Receive

const uint8_t *Dmx::GetDmxChanged([[maybe_unused]] uint32_t nPortIndex) {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	const auto *p = GetDmxAvailable(nPortIndex);

	if (p == nullptr) {
		return nullptr;
	}

	const auto *pSrc16 = reinterpret_cast<const uint16_t*>(p);
	auto *pDst16 = reinterpret_cast<uint16_t *>(&s_RxDmxPrevious[nPortIndex][0]);

	auto isChanged = false;

	for (auto i = 0; i < buffer::SIZE / 2; i++) {
		if (*pDst16 != *pSrc16) {
			*pDst16 = *pSrc16;
			isChanged = true;
		}
		pDst16++;
		pSrc16++;
	}

	return (isChanged ? p : nullptr);
#else
	return nullptr;
#endif
}

const uint8_t *Dmx::GetDmxAvailable([[maybe_unused]] uint32_t nPortIndex)  {
	assert(nPortIndex < dmx::config::max::PORTS);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	if ((s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket & 0x8000) != 0x8000) {
		return nullptr;
	}

	s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket &= ~0x8000;
	s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket--;	// Remove SC from length

	return s_RxBuffer[nPortIndex].data;
#else
	return nullptr;
#endif
}

const uint8_t *Dmx::GetDmxCurrentData(const uint32_t nPortIndex) {
	return s_RxBuffer[nPortIndex].data;
}

uint32_t Dmx::GetDmxUpdatesPerSecond([[maybe_unused]] uint32_t nPortIndex) {
	assert(nPortIndex < dmx::config::max::PORTS);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	return sv_nRxDmxPackets[nPortIndex].nPerSecond;
#else
	return 0;
#endif
}

// RDM Send

void Dmx::RdmSendRaw(const uint32_t nPortIndex, const uint8_t* pRdmData, uint32_t nLength) {
	assert(nPortIndex < dmx::config::max::PORTS);
	assert(pRdmData != nullptr);
	assert(nLength != 0);

	const auto nUart = _port_to_uart(nPortIndex);

	while (SET != usart_flag_get(nUart, USART_FLAG_TC))
		;

	switch (nUart) {
#if defined (DMX_USE_USART0)
	case USART0:
		_gpio_mode_output(USART0_GPIOx, USART0_TX_GPIO_PINx);
		GPIO_BC(USART0_GPIOx) = USART0_TX_GPIO_PINx;
		break;
#endif
#if defined (DMX_USE_USART1)
	case USART1:
		_gpio_mode_output(USART1_GPIOx, USART1_TX_GPIO_PINx);
		GPIO_BC(USART1_GPIOx) = USART1_TX_GPIO_PINx;
		break;
#endif
#if defined (DMX_USE_USART2)
	case USART2:
		_gpio_mode_output(USART2_GPIOx, USART2_TX_GPIO_PINx);
		GPIO_BC(USART2_GPIOx) = USART2_TX_GPIO_PINx;
		break;
#endif
#if defined (DMX_USE_UART3)
	case UART3:
		_gpio_mode_output(UART3_GPIOx, UART3_TX_GPIO_PINx);
		GPIO_BC(UART3_GPIOx) = UART3_TX_GPIO_PINx;
		break;
#endif
#if defined (DMX_USE_UART4)
	case UART4:
		_gpio_mode_output(UART4_TX_GPIOx, UART4_TX_GPIO_PINx);
		GPIO_BC(UART4_TX_GPIOx) = UART4_TX_GPIO_PINx;
		break;
#endif
#if defined (DMX_USE_USART5)
	case USART5:
		_gpio_mode_output(USART5_GPIOx, USART5_TX_GPIO_PINx);
		GPIO_BC(USART5_GPIOx) = USART5_TX_GPIO_PINx;
		break;
#endif
#if defined (DMX_USE_UART6)
	case UART6:
		_gpio_mode_output(UART6_GPIOx, UART6_TX_GPIO_PINx);
		GPIO_BC(UART6_GPIOx) = UART6_TX_GPIO_PINx;
		break;
#endif
#if defined (DMX_USE_UART7)
	case UART7:
		_gpio_mode_output(UART7_GPIOx, UART7_TX_GPIO_PINx);
		GPIO_BC(UART7_GPIOx) = UART7_TX_GPIO_PINx;
		break;
#endif
	default:
		assert(0);
		__builtin_unreachable();
		break;
	}

	TIMER_CNT(TIMER5) = 0;
	do {
		__DMB();
	} while (TIMER_CNT(TIMER5) < RDM_TRANSMIT_BREAK_TIME);

	switch (nUart) {
#if defined (DMX_USE_USART0)
	case USART0:
		_gpio_mode_af(USART0_GPIOx, USART0_TX_GPIO_PINx, USART0);
		break;
#endif
#if defined (DMX_USE_USART1)
	case USART1:
		_gpio_mode_af(USART1_GPIOx, USART1_TX_GPIO_PINx, USART1);
		break;
#endif
#if defined (DMX_USE_USART2)
	case USART2:
		_gpio_mode_af(USART2_GPIOx, USART2_TX_GPIO_PINx, USART2);
		break;
#endif
#if defined (DMX_USE_UART3)
	case UART3:
		_gpio_mode_af(UART3_GPIOx, UART3_TX_GPIO_PINx, UART3);
		break;
#endif
#if defined (DMX_USE_UART4)
	case UART4:
		_gpio_mode_af(UART4_TX_GPIOx, UART4_TX_GPIO_PINx, UART4);
		break;
#endif
#if defined (DMX_USE_USART5)
	case USART5:
		_gpio_mode_af(USART5_GPIOx, USART5_TX_GPIO_PINx, USART5);
		break;
#endif
#if defined (DMX_USE_UART6)
	case UART6:
		_gpio_mode_af(UART6_GPIOx, UART6_TX_GPIO_PINx, UART6);
		break;
#endif
#if defined (DMX_USE_UART7)
	case UART7:
		_gpio_mode_af(UART7_GPIOx, UART7_TX_GPIO_PINx, UART7);
		break;
#endif
	default:
		assert(0);
		__builtin_unreachable();
		break;
	}

	TIMER_CNT(TIMER5) = 0;
	do {
		__DMB();
	} while (TIMER_CNT(TIMER5) < RDM_TRANSMIT_MAB_TIME);

	for (uint32_t i = 0; i < nLength; i++) {
		while (RESET == usart_flag_get(nUart, USART_FLAG_TBE))
			;
#if defined (GD32H7XX)
		USART_TDATA(nUart) = USART_TDATA_TDATA & pRdmData[i];
#else
		USART_DATA(nUart) = (USART_DATA_DATA & pRdmData[i]);
#endif
	}

	while (SET != usart_flag_get(nUart, USART_FLAG_TC)) {
#if defined (GD32H7XX)
		static_cast<void>(GET_BITS(USART_RDATA(nUart), 0U, 8U));
#else
		static_cast<void>(GET_BITS(USART_DATA(nUart), 0U, 8U));
#endif
	}

	sv_TotalStatistics[nPortIndex].Rdm.Sent.Class++;
}

void Dmx::RdmSendDiscoveryRespondMessage(uint32_t nPortIndex, const uint8_t *pRdmData, uint32_t nLength) {
	assert(nPortIndex < dmx::config::max::PORTS);
	assert(pRdmData != nullptr);
	assert(nLength != 0);

	// 3.2.2 Responder Packet spacing
	udelay(RDM_RESPONDER_PACKET_SPACING, gv_RdmDataReceiveEnd);

	SetPortDirection(nPortIndex, dmx::PortDirection::OUTP, false);

	const auto nUart = _port_to_uart(nPortIndex);

	for (uint32_t i = 0; i < nLength; i++) {
		while (RESET == usart_flag_get(nUart, USART_FLAG_TBE))
			;
#if defined (GD32H7XX)
		USART_TDATA(nUart) = USART_TDATA_TDATA & pRdmData[i];
#else
		USART_DATA(nUart) = (USART_DATA_DATA & pRdmData[i]);
#endif
	}

	while (SET != usart_flag_get(nUart, USART_FLAG_TC)) {
#if defined (GD32H7XX)
		static_cast<void>(GET_BITS(USART_RDATA(nUart), 0U, 8U));
#else
		static_cast<void>(GET_BITS(USART_DATA(nUart), 0U, 8U));
#endif
	}

	TIMER_CNT(TIMER5) = 0;
	do {
		__DMB();
	} while (TIMER_CNT(TIMER5) < RDM_RESPONDER_DATA_DIRECTION_DELAY);


	SetPortDirection(nPortIndex, dmx::PortDirection::INP, true);

	sv_TotalStatistics[nPortIndex].Rdm.Sent.DiscoveryResponse++;
}

// RDM Receive

const uint8_t *Dmx::RdmReceive(const uint32_t nPortIndex) {
	assert(nPortIndex < dmx::config::max::PORTS);

	if ((s_RxBuffer[nPortIndex].Rdm.nIndex & 0x4000) != 0x4000) {
		return nullptr;
	}

	s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket = 0; // This is correct.
	return s_RxBuffer[nPortIndex].data;
}

const uint8_t *Dmx::RdmReceiveTimeOut(const uint32_t nPortIndex, uint16_t nTimeOut) {
	assert(nPortIndex < dmx::config::max::PORTS);

	uint8_t *p = nullptr;
	TIMER_CNT(TIMER5) = 0;

	do {
		if ((p = const_cast<uint8_t *>(RdmReceive(nPortIndex))) != nullptr) {
			return p;
		}
	} while (TIMER_CNT(TIMER5) < nTimeOut);

	return nullptr;
}
